USE `test`;

DROP TABLE IF EXISTS `books`;
DROP TABLE IF EXISTS `hibernate_sequence`;

CREATE TABLE `books` (
    `id` INT(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
    `title` VARCHAR(100),
    `description` VARCHAR(255),
    `author` VARCHAR(100),
    `isbn` VARCHAR(20),
    `year` INT,
    `read_already` BOOL)
ENGINE=innodb DEFAULT CHARACTER SET = utf8;

INSERT INTO `books` (`title`, `description`, `author`, `isbn`, `year`, `read_already`)
VALUES
("Мастер и Маргарита", "1929-1940", "Михаил Булгаков", "898999889", 1991, true),
("Война и мир", "1865-1868", "Лев Толстой", "1234567", 1992, true),
("Преступление и наказание", "Федор Достоевский", "1866", "1234567", 1993, false),
("Мертвые души", "1842", "Николай Гоголь", "1234567", 1994, true),
("Двенадцать стульев", "1928", "Илья Ильф, Евгений Петров", "1234567", 1995, false),
("Евгений Онегин", "1825-1837", "Александр Пушкин", "1234567", 1996, false),
("Отцы и дети", "1860-1861", "Иван Тургенев", "1234567", 1997, false),
("Три товарища", "1936", "Эрих Мария Ремарк", "1234567", 1998, false),
("The adventures of Huckleberry Finn", "1835-1910", "Mark Twain", "1234567", 1999, true),
("Anna Karenina", "1828-1910", "Leo Tolstoy", "1234567", 2000, false),
("Анна Каренина", "Роман", "Лев Толстой", "1234567", 2001, true),
("Don Quixote", "1547-1616", "Miguel de Cervantes Saavedra", "1234567", 2002, false),
("Faust", "1749-1832", "Johann Wolfgang", "1234567", 2003, false),
("Горе от ума", "1828", "Александр Грибоедов", "1234567", 2004, true),
("Тихий Дон", "1926-1940", "Михаил Шолохов", "1234567", 2005, false),
("Приключения Шерлока Холмса", "1887-1927", "Артур Конан Дойль", "1234567", 2006, true),
("1984", "1947-1948", "Джорж Оруэл", "1234567", 2007, false),
("451 градус по Фаренгейту", "1953", "Рэй Брэдбери", "1234567", 2008, false),
("Робинзон Крузо", "1719", "Даниэль Дефо", "1234567", 2009, false),
("Пикник на обочине", "1972", "Аркадий и Борис Стругацкие", "1234567", 2010, false),
("По ком звонит колокол", "1940", "Эрнест Хэмингуэй", "1234567", 2011, false),
("А зори здесь тихие", "1969", "Борис Васильев", "1234567", 2012, false),
("Собор Парижской Богоматери", "1831", "Виктор Гюго", "1234567", 1992, false),
("Солярис", "1961", "Станислав Лем", "1234567", 1993, false),
("Ромео и Джульета", "1591", "Уильям Шекспир", "1234567", 1993, false),
("The Idiot", "1821-1881", "Fyodor Dostoyevsky", "1234567", 1994, false),
("Invisible Man", "1914-1994", "Ralph Ellison", "1234567", 1995, false),
("Independent People", "Iceland", "Halldor Laxness", "1234567", 1996, false),
("Moby-Dick", "United States", "Hermann Melville", "1234567", 1997, false),
("Американская трагедия", "1925", "Теодор Драйзер", "1234567", 1998, false),
("Петербургские повести", "1832-1842", "Николай Гоголь", "1234567", 1999, true),
("Записки из подполья", "1864", "Федор Достоевский", "1234567", 2000, false),
("Отец Сергий", "1911", "Лев Толстой", "1234567", 1992, false),
("Доктор Живаго", "1945-1955", "Борис Пастернак", "1234567", 1993, false),
("Руслан и Людмила", "1820", "Александр Пушкин", "1234567", 1994, false),
("Вишневый сад", "1903", "Антон Чехов", "1234567", 1995, false),
("Pippi Longstocking", "Sweden", "Astrid Lindgren", "1234567", 1996, false),
("Pride and Prejudice", "England", "Jane Austen", "1234567", 1997, false),
("The Ramayana", "India", "Valmiki", "1234567", 1998, false)
;